# 6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

letter_place = int(input("Введите номер буквы датинского алфавита (от 1 до 26): "))

letter = chr(letter_place + 96)

print("В латинском алфавите на {} месте находится буква {}".format(letter_place, letter))
