"""
7. Напишите программу, доказывающую или проверяющую, что для множества натуральных чисел выполняется равенство:
   1+2+...+n = n(n+1)/2, где n — любое натуральное число.
"""


def summa(x):
    if x != 1:
        return x + summa(x - 1)
    return 1


n = int(input('Введите количество элементов ряда: '))

result = summa(n)
check = n * (n + 1) / 2

print(f"\nСумма чисел ряда 1+2+...+n: {result}")
print(f"Проверка: n * (n + 1) / 2 = {int(check)}")
