# 7. По длинам трех отрезков, введенных пользователем, определить возможность существования треугольника,
#    составленного из этих отрезков.
#    Если такой треугольник существует, то определить, является ли он разносторонним, равнобедренным или равносторонним.

print("Введите длины сторон треугольника")
a = input("Сторона a = ")
b = input("Сторона b = ")
c = input("Сторона c = ")

if a <= b + c and b <= a + c and c <= a + b:
    if a == b and a == c:
        triangle = 'Треугольник равносторонний'
    elif a != b and b != c and a != c:
        triangle = 'Треугольник разносторонний'
    else:
        triangle = 'Треугольник равнобедренный'
else:
    triangle = 'Такого треугольника не существует'

print(triangle)
