"""
4. Найти сумму n элементов следующего ряда чисел: 1, -0.5, 0.25, -0.125,
   Количество элементов (n) вводится с клавиатуры.
"""


def sum_element(x, i):
    print(i)  # вывод чисел ряда для наглядности
    if x != 1:
        i = i / (-2)
        return i + sum_element(x - 1, i)
    return 1


n = int(input('Введите количество элементов ряда: '))
k = 1

result = sum_element(n, k)

print(f"\nСумма чисел ряда: {result}")
