# 3. По введенным пользователем координатам двух точек вывести уравнение прямой вида y = kx + b,
#    проходящей через эти точки.

print("Введите координаты первой точки:")
x1 = int(input("x1="))
y1 = int(input("y1="))

print("Введите координаты второй точки:")
x2 = int(input("x2="))
y2 = int(input("y2="))

k = (y1 - y2) / (x1 - x2)
b = y2 - k * x2

print("Уравнение прямой, проходящей через точки ({},{}) и ({},{}):".format(x1, y1, x2, y2))
if b > 0:
    print("y = {:.1f} * x + {:.1f}".format(k, b))
elif b < 0:
    print("y = {:.1f} * x - {:.1f}".format(k, abs(b)))
else:
    print("y = {:.1f} * x".format(k))
