# 5. Пользователь вводит две буквы. Определить, на каких местах алфавита они стоят, и сколько между ними находится букв.

print("Введите две буквы латинского алфавита")
letter1 = input("Первая буква: ")
letter2 = input("Вторая буква: ")

place1 = ord(letter1) - 96
place2 = ord(letter2) - 96

print("Буква {} находится на {} месте".format(letter1, place1))
print("Буква {} находится на {} месте".format(letter2, place2))
print("Между буквами {} и {} находится {} букв(ы)".format(letter1, letter2, abs(place2 - place1) - 1))
